# 一个整数，它加上100后是一个完全平方数，再加上168又是一个完全平方数，请问该数是多少？
# 假设整数为x，则x+100=m²，x+268=n²，则（n+m）（n-m）=68
# 假设n+m=i，n-m=j，则ij=168，且n=（i+j）/2，m=（i-j）/2
# 因为m和n均为整数，所以i+j和i-j均为偶数，所以i，j要么都是奇数们要么都是偶数，又因为ij乘积为偶数，所以二者均为偶数
# 因为二者均为偶数，所以i，j>2，所以i<85
def find_integer():
    for i in range(2,85):
        if 168 % i == 0:
            j = 168//i
            if i > j and (i+j) % 2 == 0 and (i-j) % 2 == 0:
                n = (i+j)//2
                m = (i-j)//2
                x = m*m-100
                print(f"x:{x}, m:{m}, n:{n}")
find_integer()
